# -*- mode: org -*-
#+TITLE:      Emacs init file written in org-mode
#+AUTHOR:    Arnaud Legrand
#+EMAIL:     arnaud.legrand@imag.fr
#+STARTUP: indent
#+LANGUAGE:   en

This is a "minimal" =.emacs= configuration file. For this configuration
to work, you'll need:
- emacs24 (>24.3) (this way installing through elpa will save you some
  time) and emacs-goodies (e.g., for color themes)
- org-mode > 8.2 (there has been a major compatibility breakage so
  need to stay away from old versions)
- ess and R
- texlive and auctex

*** Add short cut keys for the org-agenda			     :ARNAUD:
#+begin_src emacs-lisp :tangle init.el
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-cc" 'org-capture)
(global-set-key (kbd "C-c a") 'org-agenda)
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map (kbd "C-c a") 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(setq org-default-notes-file "~/org/notes.org")
     (define-key global-map "\C-cd" 'org-capture)
(setq org-capture-templates (quote (("t" "Todo" entry (file+headline "~/org/liste.org" "Tasks") "* TODO %?
  %i
  %a" :prepend t) ("j" "Journal" entry (file+datetree "~/org/journal.org") "* %?
Entered on %U
  %i
  %a"))))
#+end_src

#+RESULTS:
| t | Todo    | entry | (file+headline ~/org/liste.org Tasks) | * TODO %?\n  %i\n  %a           | :prepend | t |
| j | Journal | entry | (file+datetree ~/org/journal.org)     | * %?\nEntered on %U\n  %i\n  %a |          |   |

*** Bash "sh" code:
To use this type <b and then TAB
#+begin_src emacs-lisp :tangle init.el
(add-to-list 'org-structure-template-alist
        '("b" "#+begin_src sh :results output :exports both\n\n#+end_src" "<src lang=\"sh\">\n\n</src>"))
#+end_src

To use this type <B and then TAB. This comes with a session argument
(e.g., in case you want to keep ssh connexions open).
#+begin_src emacs-lisp :tangle init.el
(add-to-list 'org-structure-template-alist
        '("B" "#+begin_src sh :session foo :results output :exports both \n\n#+end_src" "<src lang=\"sh\">\n\n</src>"))
#+end_src

#+RESULTS:
| B | #+begin_src sh\n\n#+end_src         | <src lang="sh">\n\n</src>              |
| b | #+begin_src sh\n\n#+end_src         | <src lang="sh">\n\n</src>              |
| R | #+BEGIN_SRC R :session\n\n#+END_SRC | <src lang="R">\n\n</src>               |
| r | #+begin_src R :session\n\n#+end_src | <src lang="R">\n\n</src>               |
| m | #+begin_src emacs-lisp :tangle init.el\n\n#+end_src | <src lang="emacs-lisp">\n\n</src>      |
| S | #+BEGIN_SRC ?\n\n#+END_SRC          | <src lang="?">\n\n</src>               |
| s | #+BEGIN_SRC ?\n\n#+END_SRC          | <src lang="?">\n\n</src>               |
| e | #+BEGIN_EXAMPLE\n?\n#+END_EXAMPLE   | <example>\n?\n</example>               |
| q | #+BEGIN_QUOTE\n?\n#+END_QUOTE       | <quote>\n?\n</quote>                   |
| v | #+BEGIN_VERSE\n?\n#+END_VERSE       | <verse>\n?\n</verse>                   |
| V | #+BEGIN_VERBATIM\n?\n#+END_VERBATIM | <verbatim>\n?\n</verbatim>             |
| c | #+BEGIN_CENTER\n?\n#+END_CENTER     | <center>\n?\n</center>                 |
| l | #+BEGIN_LaTeX\n?\n#+END_LaTeX       | <literal style="latex">\n?\n</literal> |
| L | #+LaTeX:                            | <literal style="latex">?</literal>     |
| h | #+BEGIN_HTML\n?\n#+END_HTML         | <literal style="html">\n?\n</literal>  |
| H | #+HTML:                             | <literal style="html">?</literal>      |
| a | #+BEGIN_ASCII\n?\n#+END_ASCII       |                                        |
| A | #+ASCII:                            |                                        |
| i | #+INDEX: ?                          | #+INDEX: ?                             |
| I | #+INCLUDE: %file ?                  | <include file=%file markup="?">        |

[18:23:44; 21.06.2013]
